<html>
	<head>
		<title>
			PASCAL-TDS : documentacion
		</title>
	</head>

	
	<body bgcolor =cacfd2> 
		<font size=5 face="tahoma" color=1c0751>
		<p align="center">
		Lenguaje: Pascal-TDS - 2017 - Taller de Dise&ntilde;o de Software (Cod. 3306)

		<font size=6 face="palatino" color=055c91>
		<p> <em> Primera etapa: Analizador sint&aacute;ctico y l&eacute;xico. </font> <br> </em> </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Organizaci&oacute;n del grupo: </font> <br> </u> </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Para comenzar, en cuanto a la comunicaci&oacute;n entre Lex y Yacc, se decidi&oacute; transmitir toda la informaci&oacute;n mediante tokens. A partir de all&iacute;, Boselli realiz&oacute; una  implementaci&oacute;n inicial del Analizador L&eacute;xico mientras que Gonz&aacute;lez y Etcharren realizaban la correspondiente al Analizador Sint&aacute;ctico. </p>

		<p align="justify">
		- Al finalizar las implementaciones "alfa", se solucionaron en conjunto los conflictos shift/reduce y se refinaron ambos analizadores. Luego,  para los casos de testing: comentarios, "end" y "begin" balanceados, a cargo de Boselli, if anidados, funciones, while, a cargo de Gonz&aacute;lez y Etcharren a cargo de la implementaci&oacute;n para descartar correctamente los comentarios largos. Se realiz&oacute; una &uacute;ltima reuni&oacute;n donde se revisaron en conjunto los puntos a mejorar para dar por finalizada esta etapa. </p>

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Decisiones de Dise&ntilde;o: </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Comunicaci&oacute;n entre Lex y Yacc mediante tokens. Esto ser&aacute; &uacute;til en un futuro para el analizador sem&aacute;ntico.

		<p align="justify"> 
		- Crear una librer&iacute;a <em>"types.c"</em> donde se definieron todos los tipos a utilizar. Para el an&aacute;lisis l&eacute;xico y sint&aacute;ctico se crearon dos de ellos: TokenStr, utilizado para enviar el nombre de una variable declarada con su numero de l&iacute;nea y TokenVal utilizado para literales enviando su valor y n&uacute;mero de l&iacute;nea. 

		<p align="justify"> 
		- Para el resto de los tokens se enviar&aacute; solo el n&uacute;mero de l&iacute;nea, ya que podr&aacute;n identificarse directamente por su nombre.

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Detalles de implementaci&oacute;n interesantes:  </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Implementaci&oacute;n de una funci&oacute;n error que permitir&aacute; especificar correctamente el error en casos de: 

			<p align="justify"> 
			* Un caracter extra&ntilde;o. </p>

			<p align="justify"> 
			* Un entero mayor a 32 bits. </p>

			<p align="justify"> 
			* Un comentario largo no cerrado. </p>

		<p> El resto de los errores ser&aacute;n notificados mediante yyerror(). 

		<p align="justify"> 
		- Implementaci&oacute;n correcta de comentarios largos mediante condiciones de entrada de Flex.


		<font size=4 face="palatino" color=1c0751>
		<p>****************************************************************************************************************************************************************************************</p>

		<font size=6 face="palatino" color=055c91>
		<p> <em> Segunda etapa: Analizador sem&aacute;ntico. </font> <br> </em> </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Organizaci&oacute;n del grupo: </font> <br> </u> </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Para comenzar, se defini&oacute; la representaci&oacute;n de la tabla de s&iacute;mbolos y el &aacute;rbol sem&aacute;ntico mediante estructuras. Luego, Gonz&aacute;lez y Etcharren realizaron la carga del &aacute;rbol mientras que Boselli, modific&oacute; las funciones ya creadas en la etapa anterior para poder reutilizarlas. A partir de all&iacute; se comenz&oacute; con una primera instancia de chequeo de tipos, continuada por Gonz&aacute;lez y optimizada por Etcharren. Boselli mejor&oacute; el script de ejecuci&oacute;n tal como era solicitado en t&eacute;rminos del proyecto y para finalizar, en conjunto se solucionaron los bugs de carga y chequeos donde tambi&eacute;n Gonz&aacute;lez realiz&oacute; los casos de pruebas necesarios para el testing.</p>

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Decisiones de Dise&ntilde;o: </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- La principal decisi&oacute;n de dise&ntilde;o fue crear un tipo <em>"item"</em>, el cual contiene: nombre, valor, tipo, tipo de retorno (en caso de ser una funci&oacute;n), funci&oacute;n y par&aacute;metros actuales de la misma. Seg&uacute;n el tipo de item (VAR, CONSTANT, OPER_AR, OPER_LOG..) se almacenar&aacute;n los datos necesarios en la estructura. Esto simplificar&aacute; el armado del &aacute;rbol ya que todo nodo tendr&aacute; la misma estructura que cada elemento de la tabla de s&iacute;mbolos, especificando el tipo de nodo a trav&eacute;s del campo type. </p>

		<p align="justify"> 
		- M&aacute;ximo 20 anidamientos de bloque en la tabla de s&iacute;mbolos. </p>

		<p align="justify"> 
		- Se manejar&aacute; todo con punteros para no generar copias.</p>

		<p align="justify"> 
		- No se podr&aacute;n declarar funciones con el mismo nombre aunque tengan distinta cantidad de par&aacute;metros, se tom&oacute; esta decisi&oacute;n ya que se analizaron posibles complicaciones a futuro. Tampoco se permitir&aacute; definir variables con el mismo nombre que una funci&oacute;n.</p>

		<p align="justify"> 
		- Los par&aacute;metros podr&aacute;n ser ocultos dentro de una funci&oacute;n declarando una variable con el mismo nombre, esta decisi&oacute;n se debe a una cuesti&oacute;n de estructura, ya que necesitaremos guardar la lista de sus par&aacute;metros con sus tipos. Por lo cual, en un primer momento se crear&aacute; el nivel correspondiente a los par&aacute;metros y luego se guardar&aacute; en el nodo correspondiente a la funci&oacute;n en el &aacute;rbol. La otra alternativa, no permitir ocultarlo, no nos pareci&oacute; adecuada.</p>

		<p align="justify"> 
		- Para funciones cuyo retorno es de tipo entero o booleano, se chequear&aacute; que al menos contenga un <em>return</em>. Consideramos que lo ideal hubiese sido realizar un chequeo exhaustivo por las ramas del &aacute;rbol, controlando en cada rama de ejecuci&oacute;n la existencia de un return. Por la complejidad que esto significaba se tom&oacute; la decisi&oacute;n de realizarlo de una manera quiz&aacute;s menos elegante, la cual se podr&aacute; ver en la implementaci&oacute;n.</p>

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Algunos problemas: </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- No se pueden definir funciones recursivas. Para que esto funcione se deber&aacute; en primer lugar, insertar en la tabla de s&iacute;mbolos el nombre de la funci&oacute;n con su tipo de retorno y p&aacute;rametros correspondientes. Luego, una vez recorrido el cuerpo, agregar el &aacute;rbol que lo representa a dicha funci&oacute;n. 


		<font size=4 face="palatino" color=1c0751>
		<p>****************************************************************************************************************************************************************************************</p>

		<font size=6 face="palatino" color=055c91>
		<p> <em> Tercera etapa: Generador c&oacute;digo intermedio. </font> <br> </em> </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Organizaci&oacute;n del grupo: </font> <br> </u> </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Antes de comenzar esta etapa, se corrigieron algunos errores correspondientes a la etapa anterior y tambi&eacute;n se agregaron algunas pruebas adicionales m&aacute;s completas. Se realizaron modificaciones en yacc, necesarias para la nueva etapa. En la operaci&oacute;n asignaci&oacute;n se agregar&aacute; como hijo derecho la variable a asignar, tambi&eacute;n chequeos de tipos en checkTree, entre otros.  </p>

		<p align="justify"> 
		- Para esta etapa se defini&oacute; una idea inicial sobre la lista de operaciones a mostrar, lo cual puede observarse en el archivo <em> "CodIntermedio.xls" </em>. Una vez en claro el funcionamiento de nuestras instrucciones, se cre&oacute; una librer&iacute;a <em> "intermediateCode.c" </em> la cual contiene la implementaci&oacute;n de las operaciones necesarias. </p>

		<p align="justify"> 
		- Se procede a la divisi&oacute;n de las tareas: Etcharren a cargo de la inicializaci&oacute;n de las estructuras necesarias, los m&eacute;todos <em> generateIntercode, initListTreeDir, insertOperation, showOperation.</em> Gonz&aacute;lez a cargo de la implementaci&oacute;n de las instrucciones de los operadores aritm&eacute;ticos y l&oacute;gicos <em>(generateOpLog, generateOpArit..).</em> Boselli a cargo de la implementaci&oacute;n de las condiciones, ciclos y llamadas a funciones <em>(generateFunctionCall, generateIf, generateWhile..)</em> para las cuales se utilizaron los labels y temporales donde fueron necesarios. </p>

		<p align="justify"> 
		- Una vez terminadas las tareas, en conjunto se realizaron los chequeos necesarios para verificar el correcto funcionamiento de los m&eacute;todos implementados, finalmente se procede a la etapa de pruebas. </p>


		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Decisiones de Dise&ntilde;o: </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Crear una librer&iacute;a <em>"intermediateCode.c"</em> donde se definieron los tipos a utilizar, como se puede observar, cada operaci&oacute;n tendr&aacute; una instrucci&oacute;n (tipo enumerado), los respectivos operadores y el resultado (punteros del tipo item definidos y utilizados en "structures.c") </p>

		<p align="justify"> 
		- Se utilizaron <em> Labels y Temporales,</em> para los indicadores de salto y resultados de operaciones respectivamente. Se decidi&oacute; en la instrucci&oacute;n asignaci&oacute;n no utilizar temporales para las variables a asignar. </p>

		<p align="justify"> 
		- En el caso de las funciones, se definieron dos labels nuevos: IC_BEGIN_FUNCTION, IC_END_FUNCTION los cuales indican el comienzo y fin de una funci&oacute;n. Se utilizar&aacute; una nueva funci&oacute;n general <em>generate(item *func)</em> la cual crear&aacute; los labels cuando sean necesarios. </p>

		<p align="justify"> 
		- Para mostrar la lista de operaciones completa, se pens&oacute; en utilizar variables globales en yacc pero debido a complicaciones con el pasaje de par&aacute;metros, se utilizaron variables est&aacute;ticas en intermediateCode. As&iacute; finalmente, se recorrer&aacute; el nivel correspondiente mostrando de manera completa todas las funciones e instrucciones correspondientes a cada programa. </p>

		<font size=4 face="palatino" color=1c0751>
		<p>****************************************************************************************************************************************************************************************</p>

		<font size=6 face="palatino" color=055c91>
		<p> <em> Cuarta etapa: Generador c&oacute;digo objeto. </font> <br> </em> </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Organizaci&oacute;n del grupo: </font> <br> </u> </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Se realizaron modificaciones en las librer&iacute;as <em>structures.c</em> y <em>ptds-sintaxis.y</em>, para poder tener la informaci&oacute;n sobre la cantidad de memoria necesaria en una funci&oacute;n, como as&iacute; tambien la localizaci&oacute;n de variables y par&aacute;metros en memoria. Estas correcciones a cargo de Etcharren y Gonz&aacute;lez, mientras Boselli comenzaba con la idea inicial sobre el paso a assembler, chequeando como genera cada instrucci&oacute;n el lenguaje c. </p>

		<p align="justify"> 
		- Luego se gener&oacute; la librer&iacute;a que contendr&aacute; la generaci&oacute;n del c&oacute;digo objeto, dividiendo las tareas: Boselli a cargo de generateAssign, generateIf, generateWhile, generateLabel, generateJump, generateLoad. Etcharren: generateRetInt, generateRetBool, generateRetVoid, generatePushParam, generateCallFunc, generateLoad, generateBeginFunc, generateEndFunc. Gonz&aacute;lez: generateSub, generatePlus, generateDiv, generateMod, generateAnd, generateOr, generateNot, generateEqAr, generateEqLog, generateNeg, generateMinnor, generateMajor. </p>

		<p align="justify"> 
		- Una vez terminadas las tareas, Etcharren realiz&oacute; los chequeos necesarios para verificar el correcto funcionamiento de los m&eacute;todos implementados. Boselli continu&oacute; con la modificaci&oacute;n de la <em>Interfaz de la l&iacute;nea de comandos</em> especificada en la Descripci&oacute;n del proyecto. Tambi&eacute;n se realizaron las modificaciones necesarias en el script para poder diferenciar entre las compilaciones en Linux y Mac, debido a algunos conflictos debido a la diferencia de sistemas operativos. Los comandos de compilaci&oacute;n se encuentran detallados en el archivo <em>README.md</em> del proyecto. Gonz&aacute;lez realiz&oacute; las modificaciones necesarias para la creaci&oacute;n del archivo <em>assemblyCode.s</em> y permitir que se almacenen en &eacute;l todas las sentencias correspondientes al c&oacute;digo assembler generado, como as&iacute; tambi&eacute;n los casos de prueba para el testing. Para finalizar, Etcharren defini&oacute; un nuevo label IC_PRINT para permitir la impresi&oacute;n de valores.</p>

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Decisiones de Dise&ntilde;o: </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- La principal decisi&oacute;n de dise&ntilde;o fue refinar el c&oacute;digo intermedio para facilitar el paso al c&oacute;digo objeto. </em>

		<p align="justify"> 
		- En la librer&iacute;a <em>structures.c</em> se defini&oacute; un nuevo atributo <em>stackSize</em> en el tipo <em>itemFunc</em> el cual contendr&aacute; la informaci&oacute;n sobre la cantidad de variables que contiene la funci&oacute;n y el nuevo atributo <em>offSet</em> en el tipo <em>item</em> el cual contendr&aacute; la informaci&oacute;n necesaria para luego setear la posici&oacute;n del mismo. </p>

		<p align="justify"> 
		- Crear una librer&iacute;a <em>"assemblyCode.c"</em> donde se definir&aacute;n las funciones necesarias para generar de forma adecuada las sentencias de c&oacute;digo assembler correspondientes a cada operaci&oacute;n, las cuales tambi&eacute;n ser&aacute;n almacenadas en un archivo <em>assemblyCode.s.</em>

		<p align="justify">
		- Modificaciones en la librer&iacute;a <em>intermediateCode.c</em> para poder invocar una funci&oacute;n dentro de otra. Para que esto funcione de forma adecuada, se resolver&aacute; primero la llamada a cada &aacute;rbol, almacenando los resultados en temporales para luego pushearlos correctamente.  As&iacute; se podra evitar la sobreescritura de los registros y posibles p&eacute;rdidas de informaci&oacute;n que puedan ocasionar errores en los c&aacute;lculos. Adem&aacute;s se corrigi&oacute; el bug donde las variables se seteaban en temporales siendo realmente no necesario.</p>

		<p align="justify"> 
		- Se tomo la decisi&oacute;n de crear una nueva sentencia <em>(print expresion;)</em> modificando todas las instancias necesarias. </p>

		<font size=4 face="palatino" color=1c0751>
		<p>****************************************************************************************************************************************************************************************</p>
		<font size=6 face="palatino" color=055c91>
		<p> <em> Etapa de optimizaci&oacute;n. </font> <br> </em> </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Optimizaci&oacute;n de constantes. </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Se recorer&aacute; el &aacute;rbol con depth first search en busca de sentencias del tipo expresiones conformadas por constantes para poder optimizar recursivamente, para ello controla que la operaci&oacute;n sea de tipo aritmeticos, logicos o relacionales. Obtenido el resultado en el caso de una optimizaci&oacute;n, sube el resultado a la cabeza actual y libera sus hijos. </p>

		<p align="justify"> 
		- Se podr&aacute; observar esta optimizaci&oacute;n en casos como las condiciones de if y while, operaciones aritm&eacute;ticas, l&oacute;gicas y relacionales (add,sub,prod,div..) </p>

		<font size=4 face="palatino" color=1e3bcc>
		<p> <u> Otras optimizaciones. </p> </u>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Sentencias <em>return</em>: al encontrar una sentencia return en un bloque, considera c&oacute;digo muerto las sentencias que lo proceden, por lo tanto las poda. No se ignor&aacute; el resto del c&oacute;digo si el return se encuentra dentro de un bloque if o while</p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- No se utilizar&aacute;n temporales para la lectura de constantes como se hac&iacute;a anteriormente. </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		-<em>Variables globales:</em> se permiti&oacute; el uso de variables globales a partir del uso de una nueva constante VARGLOBAL para distinguir el tipo de valor del item en la tabla de s&iacute;mbolos.</p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- Actualmente en caso de las sentencias statement, en cuanto a estructura, sus hijos pueden ser nulos. Esto nos permite poder realizar podas en casos como un < if(true) then .. else > podando la rama else, < if(false) then .. else> podando la rama then, < while(false) ..> podando la rama while, qued&aacute;ndonos &uacute;nicamente con los bloques necesarios. </p>

		<p align="justify"> 
		<u> If-Then:</u> Intenta optimizar la condici&oacute;n. Luego, si la misma es falsa constante elimina completamente 
    el c&oacute;digo del if; caso contrario, verdadera constante, sube el codigo correspondiente al then a la cabeza 
    actual y elimina la instrucci&oacute;n if. </p>

    <p align="justify"> 
    <u>If-Then-Else:</u> Intenta optimizar la condici&oacute;n. Luego, si la misma es falsa constante sube el c&oacute;digo correspondiente al else a la cabeza actual y elimina la instrucci&oacute;n if; caso contrario, verdadera constante, sube el c&oacute;digo correspondiente al then a la cabeza actual y elimina la instrucci&oacute;n if. Si la condici&oacute;n no es constante, intenta optimizar los bloques then y else. </p>

    <p align="justify"> 
    <u>While:</u> Intenta optimizar la condici&oacute;n. Luego, si la misma es falsa constante elimina completamente el c&oacute;digo del ciclo. Caso contrario (sea o no constante la condici&oacute;n), intenta oprtimizar el bloque del ciclo. </p>

		<p align="justify"> 
		<u>Sentencias:</u> Se intentar&aacute; optimizar su hijo izquierdo, si encuentra un return poda su hijo derecho. Si su hijo izquierdo queda con c&oacute;digo muerto, lo poda. Intenta optimizar su hijo derecho y si queda con c&oacute;digo muerto tambi&eacute;n lo poda. </p>

		<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>

		<font size=3 face="roman" color=000000>
		<p align="justify"> 
		- A continuaci&oacute;n se mostrar&aacute;n algunos ejemplos, la imagen del lado izquierdo ser&aacute; la correspondiente a la versi&oacute;n anterior mientras que la imagen del lado derecho corresponde a la versi&oacute;n optimizada.</p>

		<font size=4 face="palatino" color=1e3bcc >
		<p> <b> <em> Operaci&oacute;n suma. </em> </b> </p>

  	<img src="img-optimization/prog-sum.jpg" align="center" hspace=465/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/sum.jpg" hspace=50/>
      <img src="img-optimization/suma-op.jpg" />
    </div>

    <font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Operaci&oacute;n sustracci&oacute;n. </b> </em> </p>

		<img src="img-optimization/prog_sub.jpg" align="center" hspace=465/>
  	<p> </p>
  	<div class="imagenes">
      <img src="img-optimization/sub.jpg" hspace=50/>
      <img src="img-optimization/sub-op.jpg" />
    </div>

    <font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Sentencia if(true) then .. else. </b> </em> </p>

  	<img src="img-optimization/prog-if.jpg" align="center" hspace=450/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/if.jpg" hspace=50/>
      <img src="img-optimization/if-op.jpg" />
    </div>

    <font size=4 face="palatino" color=1c0751>

    <font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Sentencia if(false) then .. else. </b> </em> </p>

  	<img src="img-optimization/prog-if-false.jpg" align="center" hspace=450/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/if-false.jpg" hspace=50/>
      <img src="img-optimization/if-false-op.jpg" />
    </div>

    <font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Sentencia while(false). </b> </em> </p>

  	<img src="img-optimization/prog-while.jpg" align="center" hspace=465/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/while.jpg" hspace=50/>
      <img src="img-optimization/while-op.jpg" />
    </div>

   	<font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Sentencia return. </b> </em> </p>

  	<img src="img-optimization/prog-return.jpg" align="center" hspace=465/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/return.jpg" hspace=50/>
      <img src="img-optimization/return-op.jpg" />
    </div>

    <font size=4 face="palatino" color=1c0751>
		<p>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- </p>
    <font size=4 face="palatino" color=1e3bcc>
		<p> <em> <b> Uso de temporales. </b> </em> </p>

  	<img src="img-optimization/prog-asig.jpg" align="center" hspace=465/>
  	<p> </p>
		<div class="imagenes">
      <img src="img-optimization/asign.jpg" hspace=50/>
      <img src="img-optimization/asig-op.jpg" />
    </div>
	</body>
</html>